updated research
